In [70]:
import numpy as np
import pandas as pd

In [71]:
train = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')

In [72]:
train.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

In [73]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [74]:
y = train['Survived']
X = train.iloc[:,0:11]

In [75]:
X['Sex'] = [1 if x=='male' else 0 for x in X.Sex]

In [76]:
X.Embarked.replace('C',2, inplace=True)
X.Embarked.replace('Q',3, inplace=True)
X.Embarked.replace('S',1, inplace=True)

In [77]:
X.Embarked.value_counts()

1.0    644
2.0    168
3.0     77
Name: Embarked, dtype: int64

In [78]:
X.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,1.0
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,2.0
2,3,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,1.0
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,1.0
4,5,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,1.0

In [79]:
import matplotlib.pyplot as plt

#DROPPING TICKET PLEASE NOTE

In [80]:
X.isnull().sum()
X.drop(['PassengerId'],1,inplace=True)

In [81]:
X.drop(['Name'],1,inplace=True)

In [82]:
X.isnull().sum()

Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [83]:
X.drop(['Cabin'],1,inplace=True)

In [84]:
X.Embarked.fillna(method='ffill',inplace=True)

#MODELLING

In [95]:
from sklearn.linear_model import LogisticRegression as log
from sklearn.cross_validation import train_test_split as tts

In [96]:
log = log()

In [60]:
train_x,test_x,train_y,test_y = tts(X,y,test_size=.3,random_state=255)

NameError: name 'tts' is not defined

In [169]:
log.fit(train_x,train_y)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [170]:
log.score(test_x,test_y)

0.6753731343283582

In [159]:
pred = log.predict(test_x)

In [161]:
 M = pred == test_y

In [162]:
M.value_counts()

True     177
False     91
Name: Survived, dtype: int64

In [163]:
177/268

0.6604477611940298

# Predicting missing values

In [85]:
X['Tickets'] = pd.to_numeric(X.Ticket, errors = 'coerce')

In [86]:
data = X

In [87]:
data.drop(['Ticket'],1,inplace=True)

In [121]:
data.tail()

     Pclass  Sex        Age  SibSp  Parch   Fare  Embarked        Tickets
886       2    1  -2.699118      0      0  13.00       1.0  -48782.549168
887       1    0 -10.699118      0      0  30.00       1.0 -148265.549168
888       3    0  -3.699118      1      2  23.45       1.0 -148949.549168
889       1    1  -3.699118      0      0  30.00       2.0 -148949.549168
890       3    1   2.300882      0      0   7.75       3.0  110057.450832

In [89]:
mean_a = pd.DataFrame.mean(data.Age)
mean_t = pd.DataFrame.mean(data.Tickets)

In [90]:
print(mean_a)
print(mean_t)

29.69911764705882
260318.54916792738

In [91]:
data.Age.fillna(method = 'bfill', inplace=True)
data['Age'] = data.Age - mean_a

In [92]:
data.Tickets.fillna(method = 'bfill', inplace=True)
data['Tickets'] = data.Tickets - mean_t

In [99]:
data.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
Tickets     0
dtype: int64

In [100]:
train_1,test_1,train_2,test_2 = tts(data,y,train_size=.7,random_state=255)

In [109]:
from sklearn.ensemble import RandomForestClassifier as RFC

In [110]:
RFC = RFC(n_estimators = 100)

In [111]:
RFC.fit(train_1,train_2)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=None, max_features='auto', max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, n_estimators=100, n_jobs=1,
            oob_score=False, random_state=None, verbose=0,
            warm_start=False)

In [113]:
pred = RFC.predict(test_1)

In [114]:
M = pred == test_2

In [115]:
M.value_counts()

True     219
False     49
Name: Survived, dtype: int64

In [116]:
219/268

0.8171641791044776

In [ ]:
RFC.score()